<?php
if(!defined('BATTLE')) die('Доступ запрещен!');

/**
 * Класс парсинга сообщений об удачном завершении
 * @package DCMS
 * @subpackage Модуль Фотобатлов для CiTY-HeaRTs.Ru
 * @version 1.1
 * @author Stanislav WEB | Lugansk <stnisov@gmail.com>
 * @copyright Stanilav WEB
 * @date 18.08.2013
 */
class Success {
    
    const JOIN_CREATE_SUCCESS      =   "Поздравляем! Вы только что создали новый батл с вашем участием!<br>\n
                                        Вы можете принимать голоса от противоположного пола и следить за всем в
                                        разделе <b>Мой Батл</b><br>\n";
    
    const JOIN_MERGE_SUCCESS       =   "Поздравляем! Вы только что присоединились к участию в батле!<br>\n
                                        Для вас был подобраны самые достойные оппоненты!<br>
                                        Желаем Вам успехов и победы! Следить за ходом соревнования вы сможете в разделе <b>Мой Батл</b><br>\n";
    
    const JOIN_CREATE_PRIVAT       =   "Фото Батл успешно создан! Желаем вам победы! Система автоматически оповестит вас об окончании и результате.
                                        Наблюдать за ходом голосований вы сможете в разделе \"[url=%s]Мой батл[/url]\". Рассылка почты, отвечать не обязательно)))";
    
    const JOIN_MERGE_PRIVAT        =   "Вы только что подали заявку на участие в Фото Батле! Желаем вам победы! Система автоматически оповестит вас об окончании и результате.
                                        Наблюдать за ходом голосований вы сможете в разделе \"[url=%s]Мой батл[/url]\". Рассылка почты, отвечать не обязательно)))";
    
    const JOIN_START                =   "Только что стартовал батл с вашим участием!
                                         Напоминаем, вы не имеете права голоса в своем батле, и голосовать сможете только за участников противоположного пола.
                                        Дата окончания голосования: [b]%s[/b]. Система автоматически оповестит вас об окончании и результате.
                                        Наблюдать за ходом голосований вы сможете в разделе \"[url=%s]Мой батл[/url]\". Рассылка почты, отвечать не обязательно)))";
    
    const ACTIVE_VOTE_SUCCESS      =   "Ваш голос за <b>%s</b> защитан!";
    
    const FINAL_TABLE_WIN           =   "Вот и завершился очередной Фото Батл :) Спешим поздравить Вас с занятым %s местом!\n
                                         По итогам голосований в битве автар №%s с результатом %s.\n
                                         Ваш общий рейтинг увеличился на отданные вам голоса.\nСписок всех участников:\n
                                         %s";
    const FINAL_TABLE_LOOSE         =   "Вот и завершился очередной ФотоБатл :) К сожалению вы заняли %s место.\n
                                         По итогам голосований в битве автар №%s с результатом %s.\n
                                         Принимайте участие снова и снова и снова и наконец побеждайте!\n
                                         Список всех участников:\n%s";

    /**
     * template($template, $url) Генерация шаблона для форматированного вывода
     * Сделал максимум на 2 аргумента ))
     * @param string $template шаблон
     * @param string $url URL как параметр
     * @access static
     * @return var
     */
    public static function template($template, $arg1, $arg2 = null, $arg3 = null, $arg4 = null)
    {
        if($arg4 != null) return sprintf($template, $arg1, $arg2, $arg3, $arg4);
        elseif($arg3 != null) return sprintf($template, $arg1, $arg2, $arg3);
        elseif($arg2 != null) return sprintf($template, $arg1, $arg2);
        else return sprintf($template, $arg1);
    }
    

    

}
